In [1]:
! pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.8/site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /opt/anaconda3/lib/python3.8/site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

# Series

In [3]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']

In [7]:
book_title = pd.Series(book_title)
book_title

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [8]:
type(book_title)

pandas.core.series.Series

In [9]:
book_title[2]

'Python'

In [11]:
book_title.index = ['a', 'b', 'c', 'd']

In [12]:
book_title

a           C++
b          Java
c        Python
d    JavaScript
dtype: object

In [13]:
book_title['c']

'Python'

# Data Frames

In [14]:
import numpy as np

In [17]:
arr = np.random.randint(10, 100,(6,4))
arr

array([[33, 88, 62, 74],
       [94, 34, 23, 37],
       [89, 95, 23, 67],
       [58, 63, 46, 10],
       [11, 79, 45, 90],
       [69, 98, 35, 62]])

In [21]:
# To convert array to data frame
df = pd.DataFrame(data= arr)
df

    0   1   2   3
0  33  88  62  74
1  94  34  23  37
2  89  95  23  67
3  58  63  46  10
4  11  79  45  90
5  69  98  35  62

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
#For getting values from 2nd column
df[2]

0    62
1    23
2    23
3    46
4    45
5    35
Name: 2, dtype: int64

In [24]:
type(df[2])

pandas.core.series.Series

In [25]:
# For naming the column

df.columns = ['A', 'B','C','D']
df

    A   B   C   D
0  33  88  62  74
1  94  34  23  37
2  89  95  23  67
3  58  63  46  10
4  11  79  45  90
5  69  98  35  62

In [26]:
df['D']

0    74
1    37
2    67
3    10
4    90
5    62
Name: D, dtype: int64

In [27]:
# To find teh shape
df.shape

(6, 4)

In [31]:
# It shows the top  rows as specified 
df.head(n=3)

    A   B   C   D
0  33  88  62  74
1  94  34  23  37
2  89  95  23  67

In [30]:
# It shows the last rows as specified 
df.tail(n=2)

    A   B   C   D
4  11  79  45  90
5  69  98  35  62

In [32]:
# Extracting Columns
df['C']

0    62
1    23
2    23
3    46
4    45
5    35
Name: C, dtype: int64

In [35]:
# For calling multiple columns 
#cols = ['A','B']
#df[cols]

df[['A','B']]

    A   B
0  33  88
1  94  34
2  89  95
3  58  63
4  11  79
5  69  98

In [37]:
df[['B','D','A']]

    B   D   A
0  88  74  33
1  34  37  94
2  95  67  89
3  63  10  58
4  79  90  11
5  98  62  69

In [41]:
# Adding new columns
df['A+B'] = df['A'] + df['B']

In [42]:
df

    A   B   C   D  A+B
0  33  88  62  74  121
1  94  34  23  37  128
2  89  95  23  67  184
3  58  63  46  10  121
4  11  79  45  90   90
5  69  98  35  62  167

In [51]:
df['A-B'] = df['A'] * df['B']

In [52]:
df

    A   B   C   D  A+B   A-B
0  33  88  62  74  121  2904
1  94  34  23  37  128  3196
2  89  95  23  67  184  8455
3  58  63  46  10  121  3654
4  11  79  45  90   90   869
5  69  98  35  62  167  6762

In [53]:
#To remove the column
df.drop(columns= ['A-B'])

    A   B   C   D  A+B
0  33  88  62  74  121
1  94  34  23  37  128
2  89  95  23  67  184
3  58  63  46  10  121
4  11  79  45  90   90
5  69  98  35  62  167

In [55]:
df.drop(columns= ['A-B'], inplace=True)

In [56]:
df

    A   B   C   D  A+B
0  33  88  62  74  121
1  94  34  23  37  128
2  89  95  23  67  184
3  58  63  46  10  121
4  11  79  45  90   90
5  69  98  35  62  167

# Indexing/Extracting

In [60]:
df.index = "p q r s t u ".split()
df

    A   B   C   D  A+B
p  33  88  62  74  121
q  94  34  23  37  128
r  89  95  23  67  184
s  58  63  46  10  121
t  11  79  45  90   90
u  69  98  35  62  167

In [61]:
# Extracting the rows
df.loc['p']

A       33
B       88
C       62
D       74
A+B    121
Name: p, dtype: int64

In [63]:
df.loc['t']

A      11
B      79
C      45
D      90
A+B    90
Name: t, dtype: int64

In [65]:
# iloc - integer loaction

df.iloc[4]

A      11
B      79
C      45
D      90
A+B    90
Name: t, dtype: int64

In [66]:
df.iloc[0]

A       33
B       88
C       62
D       74
A+B    121
Name: p, dtype: int64

In [67]:
# Extracting multiple rows

df.iloc[2:5]

    A   B   C   D  A+B
r  89  95  23  67  184
s  58  63  46  10  121
t  11  79  45  90   90

In [69]:
df.iloc[2:5][['A','B']]

    A   B
r  89  95
s  58  63
t  11  79

In [71]:
df.iloc[-2:][['D','A+B']]

    D  A+B
t  90   90
u  62  167

In [73]:
df.iloc[-2:,-2:]

    D  A+B
t  90   90
u  62  167

# Masking - Boolean Indexing

In [74]:
df

    A   B   C   D  A+B
p  33  88  62  74  121
q  94  34  23  37  128
r  89  95  23  67  184
s  58  63  46  10  121
t  11  79  45  90   90
u  69  98  35  62  167

In [77]:
#masking
mask = df > 30
mask

       A     B      C      D   A+B
p   True  True   True   True  True
q   True  True  False   True  True
r   True  True  False   True  True
s   True  True   True  False  True
t  False  True   True   True  True
u   True  True   True   True  True

In [78]:
df[mask]

      A   B     C     D  A+B
p  33.0  88  62.0  74.0  121
q  94.0  34   NaN  37.0  128
r  89.0  95   NaN  67.0  184
s  58.0  63  46.0   NaN  121
t   NaN  79  45.0  90.0   90
u  69.0  98  35.0  62.0  167

In [79]:
df[df > 30]

      A   B     C     D  A+B
p  33.0  88  62.0  74.0  121
q  94.0  34   NaN  37.0  128
r  89.0  95   NaN  67.0  184
s  58.0  63  46.0   NaN  121
t   NaN  79  45.0  90.0   90
u  69.0  98  35.0  62.0  167

In [81]:
mask = df['B'] > 40
mask

p     True
q    False
r     True
s     True
t     True
u     True
Name: B, dtype: bool

In [82]:
# Extracting all the rows that ar > 40 that's why 'q' row is missing

# df[mask]

    A   B   C   D  A+B
p  33  88  62  74  121
r  89  95  23  67  184
s  58  63  46  10  121
t  11  79  45  90   90
u  69  98  35  62  167

In [85]:
# Extracting values from Col C AND D rows where B column has value > 40 

df[df['B'] > 40][['C','D']]

    C   D
p  62  74
r  23  67
s  46  10
t  45  90
u  35  62

In [86]:
df['A'] > 40

p    False
q     True
r     True
s     True
t    False
u     True
Name: A, dtype: bool

In [1]:
df['D'] < 50

NameError: name 'df' is not defined

In [88]:
(df['A']> 40) & (df['D']<50)

p    False
q     True
r    False
s     True
t    False
u    False
dtype: bool

In [89]:
df[(df['A']> 40) & (df['D']<50)]

    A   B   C   D  A+B
q  94  34  23  37  128
s  58  63  46  10  121

In [90]:
df

    A   B   C   D  A+B
p  33  88  62  74  121
q  94  34  23  37  128
r  89  95  23  67  184
s  58  63  46  10  121
t  11  79  45  90   90
u  69  98  35  62  167

In [92]:
#Converting from dataframe to array
df_array = df.values
df_array

array([[ 33,  88,  62,  74, 121],
       [ 94,  34,  23,  37, 128],
       [ 89,  95,  23,  67, 184],
       [ 58,  63,  46,  10, 121],
       [ 11,  79,  45,  90,  90],
       [ 69,  98,  35,  62, 167]])

# Iris Dataset

In [95]:
! ls

Numpy PDMC 2021.ipynb
Pandas PDMC 2021.ipynb
Python Built in Data Structures.ipynb
Python Functions PDMC 2021.ipynb
Python Fundamentals PDMC 2021.ipynb
Python Modules PDMC 2021.ipynb
Python OOPs PDMC 2021.ipynb
Stats and Probability.ipynb
Stats and Probability_Stndard deviation.ipynb
__pycache__

In [104]:
import os

In [105]:
os.getcwd()

'/Users/bharathtallapureddy/Downloads/ DSMC/Python Files'

In [109]:
os.chdir('/Users/bharathtallapureddy/Downloads/ DSMC/PDMC-2021/Pandas')

In [110]:
os.getcwd()

'/Users/bharathtallapureddy/Downloads/ DSMC/PDMC-2021/Pandas'

In [111]:
! ls

Pandas Assignment iris.csv

In [119]:
iris = pd.read_csv("./iris.csv")

In [120]:
type(iris)

pandas.core.frame.DataFrame

In [121]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [122]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [123]:
#Looking for number of rows and columns
iris.shape

(150, 5)

In [124]:
# Looking for list of column
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [125]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [126]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [127]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [128]:
iris['species'].nunique()

3

In [129]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [130]:
# How many setosa flowers are there?
iris[iris['species'] == 'setosa'].shape

(50, 5)

In [132]:
iris['species'].value_counts()['virginica']

50

In [133]:
iris['sepal_length'].mean()

5.843333333333335

In [134]:
iris['petal_width'].max()

2.5

In [135]:
iris['petal_width'].min()

0.1

In [136]:
iris['petal_width'].sum()

179.8

In [137]:
iris['petal_width']

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [140]:
iris.sort__values()by=["sepal_length", "sepal_width"])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [141]:
iris ['species'].apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [142]:
len('setosa')

6

In [144]:
len('virginica')

9

In [146]:
iris.apply(lambda x: x+x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

# Grouping Data Together

In [147]:
iris.aggregate('min')

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [148]:
iris.aggregate(['min', 'max', 'mean', 'median'])

        sepal_length  sepal_width  petal_length  petal_width    species
min         4.300000        2.000      1.000000     0.100000     setosa
max         7.900000        4.400      6.900000     2.500000  virginica
mean        5.843333        3.054      3.758667     1.198667        NaN
median      5.800000        3.000      4.350000     1.300000        NaN

In [149]:
groupby = iris.groupby('species')
groupby

In [150]:
groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [152]:
groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [151]:
iris[iris['species'] == 'setosa']['sepal_length'].mean()

5.005999999999999

In [153]:
groupby.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [154]:
groupby.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        170.9          73.2         12.2
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [157]:
groupby.describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.418000    2.770000   2.974000
             std     0.381024    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.125000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.464000    4.260000   5.552000
             std     0.173511    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.244000    1.326000   2.026000
             std     0.107210    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

# Handling Missing Data

In [216]:
import os

In [217]:
os.getcwd()

'/Users/bharathtallapureddy/Downloads/ DSMC/PDMC-2021/Pandas'

In [218]:
! ls

Pandas Assignment iris.csv

In [365]:
iris = pd.read_csv("./iris.csv")

In [366]:
# To ignore warnings
import warnings
warnings.filterwarnings('ignore')

In [367]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [368]:
#Creating some null elements
nan_idx = np.random.randint(0,150,20)
iris['sepal_length'][nan_idx] = np.nan

In [369]:
iris['sepal_length']

0      5.1
1      NaN
2      4.7
3      4.6
4      5.0
      ...
145    NaN
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [370]:
nan_idx = np.random.randint(0,150,15)
iris['petal_width'][nan_idx] = np.nan

In [371]:
iris['petal_width']

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    NaN
Name: petal_width, Length: 150, dtype: float64

In [372]:
iris.isna().sum()

sepal_length    20
sepal_width      0
petal_length     0
petal_width     14
species          0
dtype: int64

In [373]:
 #iris.dropna()

In [374]:
iris['sepal_length'].fillna(value = 'FILLTHIS')[:50]

0          5.1
1     FILLTHIS
2          4.7
3          4.6
4            5
5          5.4
6          4.6
7            5
8          4.4
9          4.9
10         5.4
11         4.8
12         4.8
13    FILLTHIS
14         5.8
15         5.7
16         5.4
17         5.1
18         5.7
19    FILLTHIS
20         5.4
21    FILLTHIS
22    FILLTHIS
23         5.1
24         4.8
25           5
26           5
27         5.2
28    FILLTHIS
29         4.7
30         4.8
31         5.4
32         5.2
33    FILLTHIS
34         4.9
35           5
36         5.5
37         4.9
38         4.4
39         5.1
40           5
41         4.5
42         4.4
43           5
44    FILLTHIS
45         4.8
46         5.1
47         4.6
48         5.3
49           5
Name: sepal_length, dtype: object

In [375]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             NaN          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           NaN          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          NaN  virginica

[150 rows x 5 columns]

In [376]:
#Filling the null values
iris['sepal_length'].fillna(value = round(iris['sepal_length'].mean(), 1))[:50]

0     5.1
1     5.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    5.9
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.9
20    5.4
21    5.9
22    5.9
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.9
29    4.7
30    4.8
31    5.4
32    5.2
33    5.9
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.9
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [377]:
iris['petal_width'].fillna(value = round(iris['petal_width'].mean(), 1))[:50]

0     0.2
1     0.2
2     0.2
3     0.2
4     0.2
5     0.4
6     0.3
7     0.2
8     0.2
9     1.2
10    0.2
11    0.2
12    0.1
13    0.1
14    0.2
15    0.4
16    0.4
17    0.3
18    0.3
19    1.2
20    0.2
21    1.2
22    0.2
23    1.2
24    0.2
25    0.2
26    0.4
27    0.2
28    0.2
29    0.2
30    0.2
31    0.4
32    1.2
33    0.2
34    0.1
35    0.2
36    0.2
37    0.1
38    0.2
39    0.2
40    0.3
41    0.3
42    0.2
43    0.6
44    0.4
45    0.3
46    0.2
47    0.2
48    0.2
49    0.2
Name: petal_width, dtype: float64

# Concat/Merge Dataframes

In [378]:
new_df = pd.DataFrame(np.random.randint(0,7,size = (10,4)))

In [379]:
new_df

   0  1  2  3
0  6  3  4  6
1  5  4  0  3
2  1  2  4  6
3  3  4  0  3
4  0  3  2  1
5  1  2  2  6
6  6  2  4  5
7  0  2  1  1
8  2  6  5  3
9  2  1  0  6

In [380]:
new_df['species'] = "new-species"

In [381]:
new_df.head()

   0  1  2  3      species
0  6  3  4  6  new-species
1  5  4  0  3  new-species
2  1  2  4  6  new-species
3  3  4  0  3  new-species
4  0  3  2  1  new-species

In [382]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [383]:
new_df.columns = iris.columns

In [384]:
new_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0             6            3             4            6  new-species
1             5            4             0            3  new-species
2             1            2             4            6  new-species
3             3            4             0            3  new-species
4             0            3             2            1  new-species

In [385]:
iris = pd.concat((iris,new_df), axis=0)

In [386]:
iris.shape

(160, 5)

In [387]:
# Merging Dataframe
df1 = pd.DataFrame({'S_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 2 , 4, 5, 3]})

In [388]:
df1

    S_Name  CGPA
0    Mohit     2
1    Jatin     4
2  Prateek     5
3    Mohit     3

In [389]:
df2 = pd.DataFrame({'T_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 3 , 6, 8, 9]})

In [390]:
df2

    T_Name  CGPA
0    Mohit     3
1    Jatin     6
2  Prateek     8
3    Mohit     9

In [391]:
df1.merge(df2, how = 'inner')

  S_Name  CGPA T_Name
0  Mohit     3  Mohit

In [392]:
df1.merge(df2, how = 'left')

    S_Name  CGPA T_Name
0    Mohit     2    NaN
1    Jatin     4    NaN
2  Prateek     5    NaN
3    Mohit     3  Mohit

In [393]:
df1.merge(df2, how = 'right')

  S_Name  CGPA   T_Name
0  Mohit     3    Mohit
1    NaN     6    Jatin
2    NaN     8  Prateek
3    NaN     9    Mohit

In [394]:
df1.merge(df2, how = 'outer')

    S_Name  CGPA   T_Name
0    Mohit     2      NaN
1    Jatin     4      NaN
2  Prateek     5      NaN
3    Mohit     3    Mohit
4      NaN     6    Jatin
5      NaN     8  Prateek
6      NaN     9    Mohit

# output Files

In [395]:
iris

    sepal_length  sepal_width  petal_length  petal_width      species
0            5.1          3.5           1.4          0.2       setosa
1            NaN          3.0           1.4          0.2       setosa
2            4.7          3.2           1.3          0.2       setosa
3            4.6          3.1           1.5          0.2       setosa
4            5.0          3.6           1.4          0.2       setosa
..           ...          ...           ...          ...          ...
5            1.0          2.0           2.0          6.0  new-species
6            6.0          2.0           4.0          5.0  new-species
7            0.0          2.0           1.0          1.0  new-species
8            2.0          6.0           5.0          3.0  new-species
9            2.0          1.0           0.0          6.0  new-species

[160 rows x 5 columns]

In [396]:
iris.isna().sum()

sepal_length    20
sepal_width      0
petal_length     0
petal_width     14
species          0
dtype: int64

In [398]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [399]:
from numpy import random
dataset = np.array(['paul', 'jacob', 'vince', 'paul', 'miky', 'jacob', 'warren'])
new_var = (dataset == 'paul') | (dataset == 'jacob')

In [400]:
new_var

array([ True,  True, False,  True, False,  True, False])

In [401]:
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [402]:
df = pd.concat([ser1, ser2], axis=0)

In [403]:
df

0      a
1      b
2      c
3      e
4      d
5      f
6      g
7      h
8      i
9      j
10     k
11     l
12     m
13     n
14     o
15     p
16     q
17     r
18     s
19     t
20     u
21     v
22     w
23     x
24     y
25     z
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: object